[
  {
    "url": "https://www.coindesk.com/markets/2025/05/05/bitcoin-to-see-additional-usd330b-of-corporate-treasury-inflows-by-2029-bernstein",
    "title": "Bitcoin to See Additional $330B of Corporate Treasury Inflows by 2029: Bernstein",
    "text": "Corporate treasury buying of bitcoin (BTC) could reach $330 billion by the end of 2029, broker Bernstein said in a research report Monday. Strategy (MSTR) is likely to be the largest buyer, with an additional $124 billion of the world's largest crypto, in the broker's bull case. The company led by Michael Saylor announced a further $21 billion at-the-market common stock offering last week to buy more bitcoin. \"The U.S. pro crypto regulatory regime have further accelerated the corporate ownership growth of bitcoin,\" analysts led by Gautam Chhugani wrote. Bernstein expects other listed companies to allocate around $205 billion to bitcoin acquisition strategies, led by smaller firms with lower growth looking to emulate Strategy's treasury model. Public companies now own ~2.4% of the bitcoin supply, or about 720,000 BTC on their balance sheets, the report noted. Still, Strategy's \"scale is hard to replicate\" and not every bitcoin treasury will be successful in attempting to replicate the company's playbook, the report added. Strategy acquired an additional 1,895 bitcoin last week for $180.3 million. Read more: Michael Saylor's Strategy Adds 1,895 Bitcoin, Bringing Company Stack to 555,450 BTC Will Canny is an experienced market reporter with a demonstrated history of working in the financial services industry. He's now covering the crypto beat as a finance reporter at CoinDesk. He owns more than $1,000 of SOL. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/05/05/bitcoin-treasury-firms-dry-powder-could-push-prices-up-significantly-nydig",
    "title": "Bitcoin Treasury Firms' 'Dry Powder' Could Push Prices Up Significantly: NYDIG",
    "text": "Bitcoin-holding public companies may be sitting on a powerful market catalyst: untapped issuance capacity that could meaningfully raise bitcoin’s (BTC) price, according to new research from NYDIG.  In a report published this week, Greg Cipolaro, the firm’s global head of research, points to the “dry powder” in the form of share issuance potential among bitcoin treasury companies. If these companies take advantage of their elevated equity valuations to raise new funds and buy more bitcoin, it could trigger a significant upward move in the market.  Cipolaro uses a back-of-the-envelope model to estimate the impact: applying a 10x “money multiplier” — a historical rule of thumb describing how capital inflows have historically influenced bitcoin’s market cap — he projects a potential $42,000 per-coin price increase. That would mark a roughly 44% jump from current levels near $96,000.  This market dynamic has gained new urgency following the launch of Twenty One, a bitcoin accumulation vehicle backed by Tether, Bitfinex and Cantor Fitzgerald. Unlike other firms that have folded bitcoin into broader business models, Twenty One exists solely to acquire and hold bitcoin, and has already been seeded with a substantial BTC position.  Its SPAC partner, Cantor Equity Partners, has outperformed the S&P 500 by over 347% since the deal was announced.  Across the sector, 69 public companies hold around $69.6 billion worth of bitcoin. Cipolaro’s analysis suggests that their current stock premiums over net asset value could fund even more purchases — effectively creating a feedback loop, where equity issuance fuels BTC buying, which drives up the value of both the bitcoin and the issuer’s shares.  “The implication is clear,” Cipolaro writes. “This \"dry powder\" in the form of issuance capacity could have a significant upward effect on bitcoin’s price.”  Whether or not these companies pull the trigger, the growing interest from institutions and the performance of bitcoin-forward stocks signal a shift in how capital markets approach bitcoin exposure — through balance sheets rather than just ETF flows. Disclaimer: Parts of this article were generated with the assistance from AI tools and reviewed by our editorial team to ensure accuracy and adherence to our standards. For more information, see CoinDesk’s full AI Policy.  Helene is a New York-based markets reporter at CoinDesk, covering the latest news from Wall Street, the rise of the spot bitcoin exchange-traded funds and updates on crypto markets. She is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/05/05/chainlink-to-start-new-community-rewards-program-for-link-stakers",
    "title": "Chainlink to Start New Community Rewards Program for LINK Stakers",
    "text": "Chainlink is rolling out a new community rewards program to incentivize participation in its ecosystem, starting with a token distribution from decentralized data platform Space and Time (SXT). The program, called Chainlink Rewards, allows those projects based on the network to reward eligible Chainlink node operators and community members who help secure the network. Founded in 2022, Space and Time is a decentralized data network that uses zero-knowledge proofs to verify database queries and deliver them to smart contracts. Space and Time has made 4% of their total SXT token supply (200 million) available to Chainlink ecosystem participants, including LINK Stakers. The first batch of SXT tokens, consisting of 100 million SXT, will become claimable by eligible historical and active LINK Stakers on May 8. The remaining 100 million SXT, as well as any unclaimed SXT, are planned to be made available in a separate campaign in the future. SXT will be offered to both historical and active LINK stakers. Claims will remain open for 90 days. Token incentives help drive money and users to a blockchain network, adding to demand for that network’s token and a user base that may have previously not interacted with that ecosystem. Chainlink Rewards is expected to expand over time, with additional Build partners likely to participate in future reward seasons. While token distribution will be project-specific, the broader goal is to create new incentives for users to stake LINK and engage with the Chainlink network more actively. No details have yet been shared about upcoming reward partners or the long-term schedule of the program as of Monday. Shaurya is the Co-Leader of the CoinDesk tokens and data team in Asia with a focus on crypto derivatives, DeFi, market microstructure, and protocol analysis.Shaurya holds over $1,000 in BTC, ETH, SOL, AVAX, SUSHI, CRV, NEAR, YFI, YFII, SHIB, DOGE, USDT, USDC, BNB, MANA, MLN, LINK, XMR, ALGO, VET, CAKE, AAVE, COMP, ROOK, TRX, SNX, RUNE, FTM, ZIL, KSM, ENJ, CKB, JOE, GHST, PERP, BTRFLY, OHM, BANANA, ROME, BURGER, SPIRIT, and ORCA.He provides over $1,000 to liquidity pools on Compound, Curve, SushiSwap, PancakeSwap, BurgerSwap, Orca, AnySwap, SpiritSwap, Rook Protocol, Yearn Finance, Synthetix, Harvest, Redacted Cartel, OlympusDAO, Rome, Trader Joe, and SUN. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/05/05/bitcoins-support-at-888k-in-focus-after-trendline-break-xrp-eyes-death-cross-technical-analysis",
    "title": "Bitcoin’s Support at $88.8K in Focus After Trendline Break; XRP Eyes Death Cross: Technical Analysis",
    "text": "This is a daily technical analysis by CoinDesk analyst and Chartered Market Technician Omkar Godbole. Bitcoin’s (BTC) weekend price movement has brought attention to the $88,800 support level, while XRP, the payments-focused cryptocurrency, seems close to confirming a bearish chart pattern known as the “death cross.\" BTC fell 1.5% on Sunday (UTC), diving out of a trendline connecting lows reached on April 9 and April 20, according to charts sourced from TradingView. The breakdown of the rising trendline, a demand zone, indicates that the recovery rally from April 9 lows under $75,000 may have run its course, suggesting potential for a renewed price swoon. Prices crossing below the Ichimoku cloud on the hourly chart, a momentum indicator, also suggests the same. On the downside, $88,800 could serve as a key support level, having previously capped upward moves on March 24 and April 2, which suggests it may act as a critical price point if tested again. The bearish hourly chart set up risks invalidation on renewed above the Ichimoku cloud, which would reinstate the bullish outlook for rise to $100K. XRP's recovery from April 7 lows has run out of steam, too, with prices falling back below the 50-day simple moving average (SMA). More importantly, the 50-day SMA appears on track to cross below the 200-day SMA in what is known as the death cross long-term bearish indicator. The impending death cross, against the backdrop of the overall downward trend since mid-January, raises the risk of a deeper sell-off. Note, however, that the death cross' record in predicting price trends has been mixed in both bitcoin and traditional markets.  Omkar Godbole is a Co-Managing Editor on CoinDesk's Markets team based in Mumbai, holds a masters degree in Finance and a Chartered Market Technician (CMT) member.  Omkar previously worked at FXStreet, writing research on currency markets and as fundamental analyst at currency and commodities desk at Mumbai-based brokerage houses. Omkar holds small amounts of bitcoin, ether, BitTorrent, tron and dot. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/05/05/bitcoin-could-slide-to-usd90k-as-btc-traders-eye-fed-meeting",
    "title": "Bitcoin Could Slide to $90K as BTC Traders Eye Fed Meeting",
    "text": "Bitcoin (BTC) slipped below $95,000 on Monday, with traders now eyeing a possible retreat to $90,000 or lower amid growing macro uncertainty and a shift in market focus to this week’s Federal Reserve meeting. The pullback follows a strong two-week rally, during which BTC briefly pushed past $98,000, drawing in retail interest and institutional flows. However, some analysts are flagging a confluence of technical and macro risks that could further pressure prices. “We’re back at a key resistance zone that acted as support from December to February,” said FxPro’s Alex Kuptsikevich in an email to CoinDesk.  “The next downside targets are $92,500 and $89,000. A clean break below $90,000 would be technically and psychologically damaging, taking us under the 200-day moving average.” Traders eye developments in ongoing U.S.-China tariff talks, which can tend to heavily influence bitcoin prices, and await the Federal Reserve's policy meeting later this week.  The Fed is widely expected to leave rates steady on Wednesday, but traders will monitor comments for economic projections and clarity on future rate cuts. “The combination of solid data and hopes of easing trade tensions helped markets rebound from the post-Liberation Day selloff,” Singapore-based QCP Capital noted in a morning brief.  “But with earnings season winding down, the focus now shifts to the Fed and U.S.–China trade developments. Although PCE data shows that inflationary pressures are easing, heightened import tariffs risk reigniting price instability. The key question remains whether the Fed will continue to resist political pressure from Trump to cut rates or consider a shift in stance,” QCP added. Despite the short-term pullback, spot bitcoin ETFs continue to draw inflows. Net inflows last week totaled $1.81 billion, according to SoSoValue. However, on-chain indicators suggest caution may be warranted. Glassnode flagged that the cumulative unrealized gains for long-term bitcoin holders have reached nearly 350%, a level that historically precedes periods of heavy profit-taking. Historically, LTHs begin distributing more aggressively around a 350% unrealized profit margin, which aligns with a $BTC price of ~$99.9k. As the market nears this level, increased sell-side pressure is likely, requiring strong demand to absorb it. pic.twitter.com/sZBHtyEFX5 Meanwhile, Santiment data shows meme coin chatter hit a 2025 peak in recent weeks — a sign that traders may be cycling back into higher-risk bets after months of rotation into majors and ETFs. But the shift hasn’t translated into sustained upside across the board. GORK, a memecoin tied to an AI chatbot parody account recently referenced by Elon Musk, failed to extend gains despite the high-profile attention — suggesting that celebrity-driven pumps may be losing steam in the current environment, as reported in Monday’s Crypto Daybook. Shaurya is the Co-Leader of the CoinDesk tokens and data team in Asia with a focus on crypto derivatives, DeFi, market microstructure, and protocol analysis.Shaurya holds over $1,000 in BTC, ETH, SOL, AVAX, SUSHI, CRV, NEAR, YFI, YFII, SHIB, DOGE, USDT, USDC, BNB, MANA, MLN, LINK, XMR, ALGO, VET, CAKE, AAVE, COMP, ROOK, TRX, SNX, RUNE, FTM, ZIL, KSM, ENJ, CKB, JOE, GHST, PERP, BTRFLY, OHM, BANANA, ROME, BURGER, SPIRIT, and ORCA.He provides over $1,000 to liquidity pools on Compound, Curve, SushiSwap, PancakeSwap, BurgerSwap, Orca, AnySwap, SpiritSwap, Rook Protocol, Yearn Finance, Synthetix, Harvest, Redacted Cartel, OlympusDAO, Rome, Trader Joe, and SUN. About Contact"
  }
]