[
  {
    "url": "https://www.coindesk.com/markets/2025/04/26/trump-tokens-85-weekly-surge-defies-democrats-call-for-impeachment-massive-unlocks",
    "title": "Trump Token's 85% Weekly Surge Defies Democrats' Call for Impeachment, Massive Unlocks",
    "text": "TRUMP, the memecoin tied to U.S. President Donald Trump, is up about 16% in the last 24 hours, even as Democratic lawmakers cite the president’s involvement with the token as potential grounds for impeachment and after a massive unlock earlier in the month. At a town hall on Friday, Sen. Jon Ossoff (D-Ga.) pointed to the crypto project offering its top holders an invitation to a dinner event with President Trump, calling it a clear case of selling access to the presidency, NBC News reports. “When the sitting president of the United States is selling access for what are effectively payments directly to him. There is no question that that rises to the level of an impeachable offense,” Ossify said. U.S. Senators Adam Schiff (D-Calif.) and Elizabeth Warren (D-Mass.) also sent a letter on April 25 to the U.S. Office of Government Ethics asking for an investigation to determine if President Trump violated federal ethics rules by inviting top investors.  Read more: Dinner With the U.S. President? All You Need Is $420 Worth of TRUMP The allegations stem from an announcement that a private dinner will be held on May 22, where the top 220 TRUMP memecoin holders can meet with the U.S. President. Still, the TRUMP token has kept on rising. The memecoin surged over 70% after the event was announced and has already been up 85% over the last seven days. The rise came even after the token saw a massive $320 million unlock earlier this month, significantly inflating its circulating supply. In less than three months, TRUMP token is set to endure an additional unlock of 25.1% of its current circulating supply, at the time of writing, worth nearly $780 million. Despite the recent rise, the token is still down more than 77% from its all-time high above $70, which it saw shortly after launch. Its subsequent price plunge led to an estimated $2 billion of investor losses. Read more: TRUMP Token Pops 12% After U.S. President Calls It 'The Greatest of Them All' Francisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/25/bitcoin-poised-for-strongest-weekly-gain-since-trump-win-as-etfs-gobble-usd2-7b-inflows",
    "title": "Bitcoin Poised for Strongest Weekly Gain Since Trump Win as ETFs Gobble $2.7B Inflows",
    "text": "Bitcoin (BTC) continued its spring rally on Friday and is on track for its strongest weekly showing since Trump's election victory. The largest and oldest cryptocurrency held around $95,000 during U.S. afternoon hours, up 1.8% over the past 24 hours. Ethereum’s ether (ETH) followed closely, gaining 2% to hover just over $1,800. Sui’s native (SUI), Bitcoin Cash (BCH), and Hedera’s HBAR led gains in the broad-market crypto benchmark CoinDesk 20 Index. Today's gains cap an exceptional momentum for crypto markets recovering from the early April lows amid tariff turmoil. BTC is up over 11% since Monday, putting it at its largest weekly gain since November 2024, when Donald Trump clinched the U.S. presidency, kickstarting a broad-market crypto rally. Read more: Bitcoin Traders Target $95K in Near Term; SUI Continues Multiday Rally Investor appetite from ETF investors also bounced back strongly: U.S.-listed spot bitcoin ETFs recorded $2.68 billion in net inflows this week so far, the largest since December, according to SoSoValue data. (Friday inflow data will be published later.) Bitcoin's recent strength relative to U.S. stocks and gold underscores BTC's decoupling from traditional macro assets, said David Duong, Coinbase Institutional's global head of research. \"It’s rare to witness market inflection points in real time, as we only tend to recognize major regime shifts with the benefit of time and reflection,\" Duong said in a Friday report. \"This week’s decoupling of bitcoin’s performance from that of traditional macro assets may be as close as we come to such a moment.\" \"In our view, this divergence highlights bitcoin’s maturing role as a store-of-value asset—one that is increasingly being viewed by institutional and retail investors alike as resilient against the macroeconomic forces affecting risk assets more broadly,\" he wrote. Doung noted that the thesis is gaining traction with more companies adopting BTC corporate treasuries. Following the success of Michael Saylor's Strategy, Twenty One Capital, a new firm backed by Tether, Bitfinex, SoftBank, and a Cantor Fitzgerald affiliate, also plans to hold 42,000 BTC at launch. Due in part to recent accumulation, liquidity in the spot BTC market has been \"significantly drained,\" Dr. Kirill Kretov, lead strategist at trading automation platform CoinPanel, said in a Telegram note. According to the firm's proprietary blockchain analysis, a large portion of bitcoin liquidity has been withdrawn from actively transacting addresses, including exchanges, since November 2024, exposing markets to volatile price swings. “The market is thin, vulnerable, and easily moved by large players,\" Kretov said. \"Sharp swings of 10% up or down are likely to remain the norm for now.\" While the route could be choppy, this week’s rally is likely the early innings of bitcoin's next leg higher to new records, said John Glover, chief investment officer of crypto lender Ledn. Based on his technical analysis using Elliott Waves, he said BTC began the fifth and final wave of its multi-year bull market. Elliott Wave theory suggests asset prices move in predictable patterns called waves, driven by collective investor psychology. These patterns typically unfold in five-wave trends, in which the first, third, and fifth waves are impulsive rallies, while the second and fourth waves are corrective phases. While retesting this month's low at $75,000 cannot be ruled out, Glover sees BTC climbing to a cycle top around late 2025, early 2026. \"My expectations continue to be for a rally to $133-$136k into the end of this year, beginning of next,” he said. Read more: Bitcoin Whales Return in Force, Buy the BTC Price Rally, On-Chain Data Show Krisztian Sandor is a U.S. markets reporter focusing on stablecoins, tokenization, real-world assets. He graduated from New York University's business and economic reporting program before joining CoinDesk. He holds BTC, SOL and ETH. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/25/doge-mining-firm-z-squared-to-go-public-through-merger",
    "title": "DOGE Mining Firm Z Squared To Go Public Through Merger",
    "text": "Z Squared, a firm that specializes in mining dogecoin (DOGE), the dog-themed memecoin that was propelled to mainstream recognition by Elon Musk in 2021, is merging with biopharmaceutical company Coeptis (COEP). The merger will enable the resulting company to keep DOGE mining operations going, while Coeptis’ pharmaceutical business will be spun out and operated separately. As a result, the firm will become one of the largest publicly-traded companies with a primary focus mining dogecoin and other cryptocurrencies like litecoin (LTC). “Going public provides us with broader access to capital markets to fuel the growth of our mining operations and pursue additional strategic opportunities we believe will be accretive to shareholders,” Z Squared CEO David Halabu told CoinDesk in an email. The transaction is expected to close in the third quarter of 2025. The combined entity will have 9,000 U.S.-based DOGE mining machines. The company declined to share revenue figures with CoinDesk. COEP is down 37.5% on the day. Spun out from Bitcoin (BTC) in 2013, Dogecoin follows a similar Proof-of-Work consensus mechanism, meaning that miners compete to solve an algorithmic problem in order to produce the next block on the blockchain; whoever solves it first is awarded coins for their efforts. At $27 billion in market capitalization, DOGE is currently the eighth largest cryptocurrency, just ahead of Cardano’s ADA and Tron’s TRX. With the bitcoin mining industry becoming extremely competitive in the last few years, mining operations are seeking new avenues for revenue — by dedicating resources for AI purposes, for example, or mining other cryptocurrencies like dogecoin and litecoin. Bitcoin mining firm BIT Mining (BTCM), for example, announced in December that it had made three times more money mining DOGE and LTC than BTC since it expanded into those cryptocurrencies. Z Squared isn't the first crypto miner to go public using this strategy. Other entities such as Core Scientific (CORZ) and TeraWulf (TERA) employed a similar playbook in 2022. UPDATE (April 25, 18:40 UTC): The article was updated with extra context about bitcoin miners going public through mergers. UPDATE (April 25, 19:40 UTC): The article was updated with information about COEP stock performance. Tom writes about markets, bitcoin mining and crypto adoption in Latin America. He has a bachelor's degree in English literature from McGill University, and can usually be found in Costa Rica. He holds BTC above CoinDesk's disclosure threshold of $1,000. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/25/stablecoins-could-bring-chatgpt-moment-for-blockchain-adoption-hit-usd3-7t-by-2030-citi",
    "title": "Stablecoins Could Bring 'ChatGPT' Moment to Blockchain Adoption, Hit $3.7T by 2030: Citi",
    "text": "Global bank Citi has predicted 2025 could be a possible inflection point for blockchain adoption driven by stablecoins, akin to the breakout year artificial intelligence (AI) had with popular application ChatGPT. \"2025 has the potential to be blockchain’s ‘ChatGPT’ moment,\" the bank's analysts said in a report published earlier this week. At the center of the Citi's projection are stablecoins, a class of cryptocurrencies pegged to traditional currencies like the U.S. dollar. These tokens, led by Tether's $145 billion USDT and Circle's $60 billion USDC, have seen tremendous growth recently and are increasingly being used for payments and remittances globally. Citi sees the asset class potentially growing to $1.6 trillion by 2030 in its base case from the current $230 billion, with the caveat that regulatory support and institutional integration take hold. In the bank's more optimistic scenario, the market could balloon to $3.7 trillion, though lingering structural challenges could keep the number closer to $500 billion in the bank's bear case. A major catalyst is the supportive regulatory stance in the U.S., with a recent presidential executive order directing the formation of a federal framework for digital assets, the report said. The clarity around stablecoin rules could allow these tokens to be more deeply embedded in the financial system, offering faster payments, improved transparency and more efficient asset settlement.  \"This could lead to greater adoption of blockchain-based money and spur other use cases, financial and beyond, in the U.S. private and public sector,\" the authors noted. Stablecoins are expected to remain heavily dollar-denominated in the future. The report anticipates that around 90% of stablecoins in circulation in 2030 will still be tied to the U.S. dollar, cementing its dominance. This has major implications for the global financial system. Dollar stablecoin issuers could become one of the largest buyers of U.S. Treasuries, assuming that regulations push toward backing tokens with low-risk, highly liquid traditional financial assets like government bonds. Citibank estimated issuers could hold $1.2 trillion in U.S. government debt by the end of the decade, potentially surpassing all major foreign sovereign holders.   Meanwhile, the central banks of countries in Europe and Asia will likely promote their own digital currencies, or CBDCs, the report noted. The report pointed to several risks that could hamper the growth. Stablecoins de-pegged nearly 1,900 times in 2023 alone, including more than 600 instances involving major tokens, the report's authors wrote, citing Moody's data.  In extreme cases, mass redemptions—like those following the collapse of Silicon Valley Bank (SVB) that consequently hit USDC—can disrupt crypto liquidity, force automated selloffs and ripple through financial markets, the authors added. Krisztian Sandor is a U.S. markets reporter focusing on stablecoins, tokenization, real-world assets. He graduated from New York University's business and economic reporting program before joining CoinDesk. He holds BTC, SOL and ETH. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/25/want-to-have-dinner-with-the-u-s-president-all-you-will-need-is-to-hold-usd420-worth-of-trump",
    "title": "Dinner With the U.S. President? All You Need Is $420 Worth of TRUMP",
    "text": "The team behind the Trump memecoin said Thursday that the top 220 holders on its list, where the smallest wallet holds $420 worth of TRUMP, are eligible to win dinner with President Donald Trump, contrary to rumors that a six-figure token stash was required. “We want to clarify a few things people seem confused by on X and in the Media,” the team’s X account posted. “You need $300K+ to participate (You Don't); That we're unlocking into this competition (We're Not).” The response and excitement over the competition to have \"Dinner with President Trump\" is amazing! We want to clarify a few things people seem to be confused by on X and in the Media.-You need $300K+ to participate (You Don't)-That we're unlocking into this competition (We're… TRUMP surged 70% this week, trading at around $12 as of Thursday, mainly driven by hype around the so-called “Dinner with Trump” event, according to CoinDesk’s earlier reporting. Some users on X claimed that only holders with more than $300,000 in tokens could participate. Others speculated that the wallet ranked 220 on a blockchain explorer was the minimum cutoff. In order to attend the private dinner, you must be within the top 220 holdersThis means you need at least 27,810.12 $TRUMP which amounts to $357,916.24 for dinner https://t.co/QUXi2i4C2E pic.twitter.com/AlLvlOLvun The team dismissed both claims, stating that users must register via the official leaderboard and that only time-weighted holdings during the competition will count. Currently, the leaderboard's top wallet, under the pseudonym “Sun,” holds over 1.1 million TRUMP tokens, worth nearly $14 million. The 220th spot was held by “HAR,” with just 35.3 TRUMP tokens, or about $420 in dollar terms. Twenty five wallets are listed as VIPs on the leaderboard, where the cut-off holder sits on over $400,000 worth of TRUMP. The team also addressed concerns about token unlocks affecting the leaderboard, stating that both the cliff unlock and subsequent daily unlocks would remain inaccessible for 90 days, outlasting the competition itself. “We want to say again that the tokens from the initial cliff unlock and the following 3 months of daily unlocks will remain locked, each for an additional 90 days,” it said.  Shaurya is the Co-Leader of the CoinDesk tokens and data team in Asia with a focus on crypto derivatives, DeFi, market microstructure, and protocol analysis.Shaurya holds over $1,000 in BTC, ETH, SOL, AVAX, SUSHI, CRV, NEAR, YFI, YFII, SHIB, DOGE, USDT, USDC, BNB, MANA, MLN, LINK, XMR, ALGO, VET, CAKE, AAVE, COMP, ROOK, TRX, SNX, RUNE, FTM, ZIL, KSM, ENJ, CKB, JOE, GHST, PERP, BTRFLY, OHM, BANANA, ROME, BURGER, SPIRIT, and ORCA.He provides over $1,000 to liquidity pools on Compound, Curve, SushiSwap, PancakeSwap, BurgerSwap, Orca, AnySwap, SpiritSwap, Rook Protocol, Yearn Finance, Synthetix, Harvest, Redacted Cartel, OlympusDAO, Rome, Trader Joe, and SUN. About Contact"
  }
]