[
  {
    "url": "https://www.coindesk.com/markets/2025/04/28/prediction-markets-traders-bet-big-on-easy-liberal-win-as-canadians-head-to-the-polls",
    "title": "Prediction Markets Traders Bet Big on Easy Liberal Win as Canadians Head to the Polls",
    "text": "Political bettors on Polymarket and other platforms are paying attention to Canada as the nation heads to the polls. As the country's 45th election comes to a close, a contract asking bettors to predict who will be Canada's next Prime Minister gives the Liberal Party's Mark Carney a 78% chance, and the Conservatives' Pierre Poilievre a 22% shot. Political bettors are slightly more skeptical of Carney's chances of winning than the polls, but both are pointing in the same direction. A poll aggregator from public broadcaster CBC puts Carney's chances at 89%. Myriad Markets, another prediction market, is giving Carney similar odds to Polymarket. FanDuel, a licensed betting platform open only to residents of Ontario, Canada, initially gave the Conservatives a sharp, contrarian lead of 70%, according to a report from the National Post. Still, odds have fallen in line with prediction markets, and it now gives the Liberals a roughly 80% chance of winning. Unlike the U.S. election, there isn't a crypto angle up north with leaders' campaigns focused on the trade war and inflation. A growing narrative in certain corners of the internet is that Polymarket is prone to manipulation and its numbers aren't reliable, criticisms that echo what was said in the last weeks of the U.S. election when the site gave Donald Trump a commanding lead as polls showed a tight race. Critics say Poilievre's chances are being suppressed and do not reflect the political sentiment of the populace. However, manipulating prediction markets would be expensive, and there's no credible evidence that this is happening even as Polymarket is banned in Canada's largest province after a settlement with its securities regulator. Data portal Polymarket Analytics shows that the Canadian election contract leads the platform in open interest, which is the total value of active, unsettled bets and a good measure of market engagement. Market data also shows that position holding is quite distributed, with the largest holder of the Poilivere—No side of the contracting holding 6% of all shares and the largest holder of the Carney—Yes side holding 5%. One bettor, who is betting big on Carney with a six-figure position, who spoke to CoinDesk, said their motives are non-partisan, and said that the quality of Canadian polling makes him confident that the Liberals will win. \"Poilievre needs a 7-point polling error to win and I think the probability of that is closer to 7% than his current market price of 23c,\" trader Tenadome told CoinDesk via an X DM. \"The pool of Poilievre bettors seems to largely be very dumb money that believes in things like China is rigging the polls.\" Currently, the trader with the largest winnings on the contract is \"ball-sack\" with a profit of $124,890, thanks to bets on Carney. On the other side of the trade is \"biden4prez,\" who lost just over $98,000 – the most out of any trader – betting on Poilievre and against Carney. Read more: Previewing the Canadian Election's Crypto Angle   Sam Reynolds is a senior reporter based in Asia. Sam was part of the CoinDesk team that won the 2023 Gerald Loeb award in the breaking news category for coverage of FTX's collapse. Prior to CoinDesk, he was a reporter with Blockworks and a semiconductor analyst with IDC.  About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/28/bitcoin-to-hit-new-all-time-high-around-120k-in-q2-standard-chartered",
    "title": "Bitcoin to Hit New All-Time High Around $120K in Q2, Standard Chartered Says",
    "text": " Strategic allocation away from U.S. assets by investors could see bitcoin hit a new all-time high in the second quarter of the year, Standard Chartered's Geoff Kendrick said in a report Monday. Kendrick sees the world's largest cryptocurrency as reaching $120,000 this quarter as he reiterated his previous target of $200,000 by the end of 2025.  Bitcoin was trading around $95,300 at publication time. Kendrick noted that the U.S. Treasury term premium, which is closely correlated to the bitcoin price, is at a 12-year high. Accumulation by whales has also been strong. In addition, bitcoin time-of-day analysis suggests that American investors may be looking for non-U.S. assets, he said. Lastly, exchange-traded fund (ETF) flows in the last week suggest \"safe-haven reallocation from gold into BTC,\" wrote Kendrick. \"Bitcoin may be a better hedge than gold against financial system risks,\" he added. Read more: Tariffs, Trade Tensions May Be Positive for Bitcoin Adoption in Medium Term: Grayscale Will Canny is an experienced market reporter with a demonstrated history of working in the financial services industry. He's now covering the crypto beat as a finance reporter at CoinDesk. He owns more than $1,000 of SOL. About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/28/strategy-adds-additional-142b-of-bitcoin-with-latest-purchase",
    "title": "Strategy Adds Additional $1.42B of Bitcoin With Latest Purchase",
    "text": "Disclaimer: The analyst who wrote this piece owns shares of Strategy (MSTR) Strategy (MSTR) added another 15,355 BTC to its balance sheet over the past week, spending about $1.42 billion on the purchase, or an average price of $92,737 per bitcoin, according to a filing published on Monday. The company's bitcoin holdings have now risen to 553,555 BTC worth more than $52 billion at bitcoin's current price just north of $95,000. The average purchase price for MSTR's total stack is $64,459 each. This latest acquisition was funded through proceeds from the company's two at-the-market stock offerings, the filing noted. Between April 21 and April 27, Strategy sold over $4 million worth of its Class A common stock and more than 435,000 shares of its preferred stock series, STRK.According to the 8-K filing, only $128.7 million of the common stock ATM program remains, representing just 0.6% of the initial $21 billion that began in October 2024. Shares of MSTR are up 1.5% in pre-market trading alongside a modest rise in the price of bitcoin since Friday afternoon.  James Van Straten is a Senior Analyst at CoinDesk, specializing in Bitcoin and its interplay with the macroeconomic environment. Previously, James worked as a Research Analyst at Saidler & Co., a Swiss hedge fund, where he developed expertise in on-chain analytics. His work focuses on monitoring flows to analyze Bitcoin's role within the broader financial system. In addition to his professional endeavors, James serves as an advisor to Coinsilium, a UK publicly traded company, where he provides guidance on their Bitcoin treasury strategy. He also holds investments in Bitcoin, MicroStrategy (MSTR), and Semler Scientific (SMLR). About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/28/monero-price-surge-likely-attributable-to-large-hack-zachxbt",
    "title": "Monero Price Surge Likely Attributable to Large Hack: ZachXBT",
    "text": "On-chain researcher ZachXBT may have determined why privacy coin Monero (XMR) surged as much as 40% early Monday: Someone probably got hacked. Nine hours ago a suspicious transfer was made from a potential victim for 3520 BTC ($330.7M)Theft addressbc1qcrypchnrdx87jnal5e5m849fw460t4gk7vz55gShortly after the funds began to be laundered via 6+ instant exchanges and was swapped for XMR causing the XMR price to spike… ZachXBT reported that 3,520 bitcoin (BTC) ($330.7 million) was drained from an address and then swapped for XMR. Market data shows a spike in volatility coming from an excess in buy orders for the XMR-BTC order book. Market observers initially had a hard time determining what caused the major spike as metrics such as active wallets and network activity hadn't risen accordingly. Read More: Monero’s XMR Rockets 40% as XRP Leads Crypto Majors Gains Liquidity for XMR has been limited during the past few months as major exchanges delisted the privacy token in a bid to fight dark net markets. The lack of liquidity would have made any sizeable buy a catalyst for outsized pricing gains. CoinGecko data shows that the order depth for XMR is significantly smaller than for tokens of similar market cap. XMR is trading for over $300 according to CoinDesk markets data.  Sam Reynolds is a senior reporter based in Asia. Sam was part of the CoinDesk team that won the 2023 Gerald Loeb award in the breaking news category for coverage of FTX's collapse. Prior to CoinDesk, he was a reporter with Blockworks and a semiconductor analyst with IDC.  About Contact"
  },
  {
    "url": "https://www.coindesk.com/markets/2025/04/28/bitcoin-turns-positive-year-to-date-as-it-veers-toward-digital-gold-narrative",
    "title": "Bitcoin Turns Positive Year-to-Date as It Veers Toward Digital Gold Narrative",
    "text": "Bitcoin (BTC) returned to positive territory for the year for the first time in almost two months, approaching $95,000 and erasing a drop of as much as 18%. Its current performance, up less 1.5% since Dec. 31, places it between gold, which has gained 24% and the Nasdaq 100, which is down over 7%. As a result, the narrative positioning bitcoin as either a leveraged tech stock or digital gold is leaning slightly toward the digital gold narrative. But only just. Analyzing bitcoin’s correlation coefficients over a 30-day moving average, the largest cryptocurrency by market capitalization now shows a strong correlation of 0.70 with gold and a weaker 0.53 correlation with the Nasdaq 100. This suggests bitcoin is aligning more closely with gold's behavior than with tech equities. Correlation values can run between 1, a strong positive correlation, and -1, a strong negative correlation. Last week, the bitcoin price rose 10%, its strongest performance since the week ended Nov. 17 during price run following President Donald Trump's election victory.  Meanwhile, Trump’s tariffs continue to feed economic uncertainty. U.S. levies on Chinese goods were raised to 145% earlier this month, leading to a significant drop in cargo shipment demand, according to Bloomberg. As noted in the report, major retailers like Walmart are warning that empty shelves and higher prices could return, reminiscent of the COVID era. James Van Straten is a Senior Analyst at CoinDesk, specializing in Bitcoin and its interplay with the macroeconomic environment. Previously, James worked as a Research Analyst at Saidler & Co., a Swiss hedge fund, where he developed expertise in on-chain analytics. His work focuses on monitoring flows to analyze Bitcoin's role within the broader financial system. In addition to his professional endeavors, James serves as an advisor to Coinsilium, a UK publicly traded company, where he provides guidance on their Bitcoin treasury strategy. He also holds investments in Bitcoin, MicroStrategy (MSTR), and Semler Scientific (SMLR). About Contact"
  }
]